server/artillery/booking.yml
config:
  target: 'http://localhost:3005'
  processor: "./bookingFunctions.js"
  ensure:
    p95: 2000
  phases:
    - duration: 10 # last 1 seconds with 10 virtual users arriving every second
      arrivalRate: 2
  defaults:
    headers:
      x-my-service-auth: '987401838271002188298567'
scenarios:
  - name: "Make a reservation"
    flow:
    - function: "createReservation"
    - loop:
      - post:
          url: "/booking/{{ restaurantID }}"
          json:
            partySize: "{{ partySize }}"
            dateTime: "{{ dateTime }}"
    count: 1000
  - name: "View reserved dates"
    flow:
    - function: "checkReserved"
    - loop:
      - get:
          url: "/booking/reserved/{{ restaurantID }}"
          json:
            partySize: "{{ partySize }}"
            dateTime: "{{ dateTime }}"
    count: 1000